Autodesk.Revit.DB.Architecture.BalusterInfo.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Architecture.BalusterInfo.DistanceFromPreviousOrSpace
The length, in case of balusters, it is a distance from a previous one.
For a post, it is a space from the original position of the post.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for distanceFromPreviousOrSpace is not finite
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for distanceFromPreviousOrSpace must be greater than 0 and no more than 30000 feet.
Since:
2019

Autodesk.Revit.DB.Architecture.BalusterInfo.Offset
The side offset of the baluster/post from the railing path.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for offset must be no more than 30000 feet in absolute value.
Since:
2019

Autodesk.Revit.DB.Architecture.BalusterInfo.TopOffset
The offset from the top reference.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for topOffset must be no more than 30000 feet in absolute value.
Since:
2019

Autodesk.Revit.DB.Architecture.BalusterInfo.BaseOffset
The offset from the base reference.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for baseOffset must be no more than 30000 feet in absolute value.
Since:
2019

Autodesk.Revit.DB.Architecture.BalusterInfo.TopReferenceName
Represents the name of the reference for the top of this baluster or post.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The topReferenceName doesn't refer to a valid reference.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.Architecture.BalusterInfo.BaseReferenceName
Represents the name of the reference for the bottom of this baluster or post.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The baseReferenceName doesn't refer to a valid reference.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.Architecture.BalusterInfo.Name
The name of the baluster.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: name is an empty string or contains only whitespace.
-or-
When setting this property: name cannot include prohibited characters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.Architecture.BalusterInfo.BalusterFamilyId
The id of the family used for the baluster or post.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The balusterFamilyId doesn't refer to a valid baluster family.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.Architecture.BalusterInfo
The class represents an instance of a railing baluster or post.
Since:
2019